tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
# Collaborative design tool with support for Sketch files
cask "abstract"
# Application launcher and productivity software
cask "alfred"
# Web browser focusing on privacy
cask "brave-browser"
# Visually compare and merge files
cask "diffmerge"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
# Free and open-source image editor
cask "gimp"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Password manager app
cask "keepassxc"
# GPU-based terminal emulator
cask "kitty"
# Markdown editor
cask "mark-text"
# Multi-platform web browser
cask "microsoft-edge"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Colour picker for colours onscreen
cask "pika"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Real time file synchronisation software
cask "syncthing"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
vscode "bierner.color-info"
vscode "catppuccin.catppuccin-vsc"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "guillaumedoutriaux.name-that-color"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "royaction.color-manager"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Fast partial replacement for the codemod tool
brew "fastmod"
# Simple, fast and user-friendly alternative to find
brew "fd"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Terminal JSON viewer
brew "fx"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image processing tools collection
brew "graphicsmagick"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Pager program similar to more
brew "less"
# SIXEL encoder/decoder implementation
brew "libsixel"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Language Server for the Lua language
brew "lua-language-server"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Show markdown documents on text terminals
brew "mdcat"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Nice to use pager for humans
brew "moar"
# Node version management
brew "n"
# Parser generator tool and incremental parsing library
brew "tree-sitter", args: ["HEAD"]
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Paragraph reflow for email
brew "par"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# File browser
brew "ranger"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# URL extractor/launcher
brew "urlview"
# Image processing library
brew "vips"
# Simple terminal image viewer written in Rust
brew "viu"
# Pager/text based browser
brew "w3m"
# Watch files and take action when they change
brew "watchman"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# Shell extension to navigate your filesystem faster
brew "zoxide"
