tap "homebrew/dupes"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "neovim/neovim"

brew "git"
brew "git-flow"

brew "zsh"
brew "zsh-completions"
brew "bash-completion"
brew "brew-cask-completion"

brew "node"
brew "python2"
brew "python3"
brew "ruby"
brew "yarn"

brew "ansible"
brew "ansible-lint"

# ranger tools
brew "atool"
brew "highlight"
brew "media-info"
brew "urlview"
brew "w3m"

brew "cloc"
brew "ctags"
brew "editorconfig"
brew "neovim", args: ["HEAD"]

brew "hadolint"
brew "shellcheck"
brew "tidy-html5"

# brew "htop"
brew "ifstat"
brew "mas"
brew "multitail"
brew "neofetch"
brew "par"
brew "tldr"
brew "tmux"
brew "reattach-to-user-namespace"
brew "trash"
brew "tree"
brew "wget"
brew "jq"

brew "svgo"
brew "vips", args: ["with-imagemagick", "with-mozjpeg", "with-jpeg-turbo"]

brew "exa"
brew "fasd"
brew "fd"
brew "fzf"
brew "ranger"
brew "ripgrep"
brew "z"

# brew "homebrew/php/brew-php-switcher"
# brew "homebrew/php/php72"
# brew "homebrew/php/composer"

cask "dash"
cask "diffmerge"
cask "imageoptim"
cask "iterm2"
cask "macdown"
cask "opera"
cask "postman"
cask "sequel-pro"
cask "sourcetree"
cask "ssh-tunnel-manager"
cask "transmit"
cask "visual-studio-code"

cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"

cask "alfred"
cask "appcleaner"
cask "carbon-copy-cloner"
cask "dropbox"
cask "google-backup-and-sync"
cask "rambox"
cask "spotify"
# cask "thunderbird"

cask "adobe-creative-cloud"
cask "xquartz"
cask "inkscape"
cask "gimp"

cask "caskroom/fonts/font-firacode-nerd-font"
cask "caskroom/fonts/font-hasklig-nerd-font-mono"
cask "caskroom/fonts/font-inconsolata"

# mas "Delete Apps", id: 1033808943
mas "Magnet", id: 441258766
mas "Pocket", id: 568494494
mas "Renamer", id: 402286241
mas "Rocket.Chat+", id: 1086818840
mas "Stay", id: 435410196
mas "Skitch", id: 425955336
mas "The Archive Browser", id: 510232205
mas "The Unarchiver", id: 425424353
