tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
cask "abstract"
cask "alfred"
cask "amethyst"
cask "authy"
cask "brave-browser-beta"
cask "cyberduck"
cask "dash"
cask "deepl"
cask "diffmerge"
cask "firefox", args: { language: "en" }
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "gimp"
cask "hammerspoon"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "kitty"
cask "microsoft-edge"
cask "miniconda"
cask "obsidian"
cask "raindropio"
cask "slack"
cask "sourcetree"
cask "syncthing"
cask "visual-studio-code"
cask "wezterm"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
brew "asciidoctor"
brew "bash-completion"
brew "bat"
brew "broot"
brew "chafa"
brew "clifm"
brew "ctags"
brew "curl"
brew "editorconfig"
brew "efm-langserver"
brew "emscripten"
brew "exiftool"
brew "fasd"
brew "fastmod"
brew "fd"
brew "fileicon"
brew "fx"
brew "fzf"
brew "fzy"
brew "git"
brew "git-filter-repo"
brew "gitui"
brew "go"
brew "gobject-introspection"
brew "graphicsmagick"
brew "highlight"
brew "jq"
brew "lazygit"
brew "lf"
brew "libsixel"
brew "lnav"
brew "lua-language-server"
brew "luajit-openresty"
brew "media-info"
brew "n"
brew "tree-sitter", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "nghttp2"
brew "ninja"
brew "nnn"
brew "par"
brew "python@3.10"
brew "ranger"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "svgo"
brew "tealdeer"
brew "tidy-html5"
brew "tokei"
brew "trash"
brew "tree"
brew "urlview"
brew "vips"
brew "viu"
brew "w3m"
brew "watchman"
brew "wget"
brew "xplr"
brew "zoxide"
brew "zplug"
brew "zsh"
