tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "kabel/php-ext"
tap "neovim/neovim"
brew "python"
brew "ansible"
brew "ansible-lint"
brew "atool"
brew "autoconf"
brew "bash-completion"
brew "cassandra"
brew "libuv"
brew "cassandra-cpp-driver"
brew "cloc"
brew "cmake"
brew "composer"
brew "ctags"
brew "editorconfig"
brew "exa"
brew "exiftool"
brew "fasd"
brew "fastmod"
brew "fd"
brew "node", link: false
brew "fx"
brew "fzf"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "python@2"
brew "graphicsmagick"
brew "hadolint"
brew "highlight"
brew "ifstat"
brew "jq"
brew "mas"
brew "media-info"
brew "multitail"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nginx", restart_service: true
brew "openssl@1.1"
brew "par"
brew "tidy-html5"
brew "php@7.1", restart_service: true, link: true
brew "php@7.1-memcache", args: ["HEAD"]
brew "php@7.2", restart_service: true
brew "ranger"
brew "reattach-to-user-namespace"
brew "recode"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "svgo"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "urlview"
brew "vips", args: ["with-imagemagick", "without-graphicsmagick"]
brew "w3m"
brew "watchman"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-completions"
cask "adobe-creative-cloud"
cask "alfred"
cask "appcleaner"
cask "carbon-copy-cloner"
cask "color-oracle"
cask "dash"
cask "diffmerge"
cask "docker"
cask "dropbox"
cask "font-firacode-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "font-inconsolata"
cask "forticlient"
cask "gimp"
cask "github"
cask "google-backup-and-sync"
cask "graphiql"
cask "imageoptim"
cask "inkscape"
cask "keepassxc"
cask "keeweb"
cask "logitech-control-center"
cask "macdown"
cask "opera"
cask "postman"
cask "rambox"
cask "sequel-pro"
cask "sketch"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "ssh-tunnel-manager"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "xquartz"
cask "zeplin"
mas "iMovie", id: 408981434
mas "Magnet", id: 441258766
mas "Pocket", id: 568494494
mas "Renamer", id: 402286241
mas "Rocket.Chat", id: 1086818840
mas "Skitch", id: 425955336
mas "The Archive Browser", id: 510232205
mas "The Unarchiver", id: 425424353
